export const introData = [
  {
    index: 0,
    text: "Привет! Я - кот Статус, расскажу, что тебя ждет в игре. Сейчас я работаю волонтером в Ночлежке.",
  },
  {
    index: 1,
    text: "Но так было не всегда... <br/> Пару лет назад я потерял все",
  },
  {
    index: 2,
    text: "В Ночлежке мне помогли. <br/>Теперь у меня есть дом",
  },
  {
    index: 3,
    text: "Ночлежка — это благотворительная общественная организация. Наша цель:<br/>● реабилитация бездомных людей <br/>● профилактика бездомности, основанная на принципах гуманности, добровольности, уважения личности и ее прав.",
  },
  {
    index: 4,
    text: "Ночлежка появилась в 1990 году в Петербурге. <br/>● Мы кормим, обогреваем, помогаем с документами, работой, <br/>● оформлением инвалидностей, пособий, устройством в интернаты, в поиске родственников, <br/>● оспариваем незаконные сделки с недвижимостью и защищаем права людей без дома и регистрации.",
  },
  {
    index: 5,
    text: "Давай сначала я покажу тебе что и как здесь все работает",
  },
  {
    index: 6,
    text: "Смотри...<br/>Шестеренка – это твой профиль. Здесь ты можешь поменять имя, пароль",
  },
  {
    index: 7,
    text: "И в любой момент ты можешь выключить звук. Эта функция находится внутри шестеренки",
  },
  {
    index: 8,
    text: "А теперь я познакомлю тебя с нашими проектами. <br/>Иди за мной",
  },
];

export const nightBusIntro = [
  {
    index: 0,
    text: "Приветствую тебя на первой локации «Ночной автобус»! Это мобильный пункт социальной помощи от благотворительной организации Ночлежка, где любой нуждающийся может  бесплатно: <br/>● получить горячий ужин <br/>● консультацию водителя-соцработника  <br/>● помощь медиков-волонтёров.",
  },
  { index: 1, text: "Расскажи мне, пожалуйста, о нем! " },
  { index: 2, text: "Давай подойдем поближе." },
  {
    index: 3,
    text: "В этом году проекту исполнилось 20 лет, всё это время он бесперебойно кормит бездомных людей в Петербурге, а с 2021 года и в Москве. ",
  },
  { index: 4, text: "Расскажи, пожалуйста, чем  занимаются волонтеры?" },
];

export const nightBusEntry = [
  {
    index: 0,
    text: "Водитель – наш сотрудник. Он, как дирижер в оркестре, всем здесь управляет. <br/>Ему всегда помогают 4 волонтера.",
  },
  {
    index: 1,
    text: "Мужчина–волонтер стоит перед машиной, где происходит раздача, <br/>● он просит не торопиться и пропускать вперед женщин, людей с инвалидностью. <br/>● он раздает ложки и контролирует очередь, <br/>● Следит за порядком и меняет пакеты для мусора.",
  },
  { index: 2, text: "Как все продумано!" },
  {
    index: 3,
    text: "Еще один человек в кузове разливает суп/второе (чай/кофе), <br/>второй – раздает хлеб или сладости.<br/>Четвертый волонтер записывает всех клиентов в CRM-систему.",
  },
  {
    index: 4,
    text: "Если клиенту стало плохо, нужно вызвать скорую помощь. <br/>А также один раз в неделю выезжают два волонтера-медика.",
  },
  {
    index: 5,
    text: "Это очень хорошо, что есть волонтеры–медики! Можно сразу оказать помощь нуждающимся.",
  },
  {
    index: 6,
    text: "Так же в машине всегда есть одежда по сезону для волонтеров. Водитель следит, чтобы все волонтеры были в форме Ночлежки для того, чтобы клиенты знали, к кому можно обратиться с вопросом, а водитель видел всех волонтеров в толпе и мог контролировать их безопасность.",
  },
  {
    index: 7,
    text: "Также водитель рассказывает клиентам про проекты Ночлежки и какую помощь они могут получить в наших проектах.<br/>У водителя есть листовки с необходимой информацией.",
  },
  {
    index: 8,
    text: "Это очень хорошо, что бездомные могут узнать и о других проектах Ночлежки!",
  },
  {
    index: 9,
    text: "Мы называем Ночной автобус «Точкой входа» в организацию. Придя за тарелкой супа, клиент узнает о других наших проектах и о той помощи. Бездомные люди узнают<br/>● как можно улучшить свою жизнь, <br/>● решить юридические и медицинские проблемы, <br/>● научиться самостоятельно защищать свои права.",
  },
];

export const nightBusStory = [
  {
    index: 0,
    text: "Давайте поближе познакомимся с работой Ночного автобуса.<br/> <br/>Сегодня к вам подошёл Михаил. Ваша задача — не только накормить его, но и рассказать о возможностях,<br/>которые мы предоставляем, и о правилах, которые нужно соблюдать.",
  },
  {
    index: 1,
    text: "Хочу обратить твое внимание на интерфейс, в нем находится шкала ошибок и стресса. <br/>Здесь будут накапливаться твои ошибки.",
  },
  {
    index: 2,
    text: "Если шкала будет заполнена, тебе необходимо посетить КНИГУ ПРАВИЛ.<br/>Домик – это твой опыт. Чуть позже я подробнее расскажу тебе о нём.",
  },
  {
    index: 3,
    text: "Здравствуйте. Можно мне тарелку супа? Я не ел с утра...",
  },
  {
    index: 4,
    options: [
      {
        text: "Конечно, Михаил. Вот, возьмите суп и хлеб. Хотите узнать больше о том, как мы можем вам помочь?",
        correctAnswer: true,
      },
      {
        text: "Еда только для тех, кто уже зарегистрировался у нас. Вам нужно сначала заполнить анкету",
        correctAnswer: false,
      },
    ],
  },
  {
    index: 5,
    text: "Спасибо за еду. Я раньше не слышал о вас. Что это за автобус?",
  },
  {
    index: 6,
    options: [
      {
        text: "Это 'Ночной автобус' от 'Ночлежки'. Мы ездим по городу и раздаём еду бездомным, оказываем первую помощь и консультируем по любым вопросам",
        correctAnswer: true,
      },
      {
        text: "Это просто благотворительный автобус, который иногда ездит по городу. Мы даём еду, и на этом всё",
        correctAnswer: false,
      },
    ],
  },
  {
    index: 7,
    text: "А что нужно, чтобы снова сюда прийти? Какие у вас правила?",
  },
  {
    index: 8,
    options: [
      {
        text: "Нужно обязательно принести документы, иначе мы не сможем вас обслужить",
        correctAnswer: false,
      },
      {
        text: "Правила простые: ведите себя спокойно, уважайте других людей, пропускайте вперед женщин и инвалидов. Мы работаем по определённому графику, и вы всегда можете найти нас здесь в это время.",
        correctAnswer: true,
      },
    ],
  },
  {
    index: 9,
    text: "Не переживай и не расстраивайся, если будут ошибки! Наш психолог поможет тебе справится со стрессом",
  },
  {
    index: 10,
    text: "Знаете, в последнее время я стал хуже себя чувствовать. <br/>Простудился, но идти в больницу боюсь и не хочу. <br/>Не знаю, что делать. Дайте какую–то таблетку.",
  },
  {
    index: 11,
    options: [
      {
        text: "Просто отдохните и попейте горячего чая. Всё само пройдёт.",
        correctAnswer: false,
      },
      {
        text: "Если вам станет плохо, сразу скажите об этом любому волонтёру. Мы можем оказать первую помощь, дать таблетки и вызвать машину скорой помощи.",
        correctAnswer: true,
      },
    ],
  },
  {
    index: 12,
    text: "Я уже давно на улице и даже не знаю, как вернуться к обычной жизни. С чего начать?",
  },
  {
    index: 13,
    options: [
      {
        text: "Для начала вам нужно прийти в консультационный центр . Мы поможем на каждом этапе.Держите нашу листовку с подробной информацией",
        correctAnswer: true,
      },
      {
        text: "Вам нужно самому решить, что делать. Мы не можем помочь в таких вопросах.",
        correctAnswer: false,
      },
    ],
  },
  {
    index: 14,
    text: "Спасибо за помощь... Я подумаю над вашими словами.",
  },
  {
    index: 15,

    options: [
      {
        text: "Не откладывайте. Чем раньше вы начнете, тем быстрее мы сможем вам помочь. Я здесь, чтобы поддержать вас.",
        correctAnswer: true,
      },
      {
        text: "Как хотите. Я здесь только чтобы раздавать еду.",
        correctAnswer: false,
      },
    ],
  },
  {
    index: 16,
    text: "Отличная работа! Ты молодец!",
  },
];

export const nightBusGameIntro = [
  {
    index: 0,
    text: "В Ночлежке мы следим, чтобы наши сотрудники и волонтеры чувствовали себя комфортно, отдыхали. <br/>Я тоже предлагаю тебе отдохнуть. <br/> Давай сыграем в мини игру.",
  },
  {
    index: 1,
    text: "Нужно накормить 6 нуждающихся. <br/> Будь внимателен. На подносе должны быть все три составляющих ужина. <br/> Нужно поторопиться, у клиентов есть шкала стресса. <br/>Желаю удачи!",
  },
];

export const nightBusGameEnd = [
  {
    index: 0,
    text: "Молодец!Хорошая работа! У тебя все получилось! <br/>Поздравляю тебя! Первая локация позади",
  },
  {
    index: 1,
    text: "Тебе в подарок Кружки дружбы! <br />Жми «Забрать",
  },
  {
    index: 2,
    text: "Они будут хранится в Рюкзаке. <br/>В нем будут хранится все найденные в локациях предметы",
  },
  {
    index: 3,
    text: "У тебя появился Домик Опыта, как я уже говорил тебе. <br/>При успешном прохождении локаций, у тебя будет строится твой дом – накапливаться опыт. <br/>Смотри, ты получил опыт, у тебя есть фундамент дома!",
  },
  {
    index: 4,
    text: "В дальнейшем, ты можешь зайти в свой дом и расставить там предметы из рюкзака. <br/>Вот такой домик у тебя получится в конце игры.",
  },
  {
    index: 5,
    text: "Карта поможет тебе вернуться на главный экран и выбрать следующую локацию",
  },
  {
    index: 6,
    text: "Жми на меня, на помощника Статуса, если нужна будет помощь.",
  },
  {
    index: 7,
    text: "Вперед! К новым испытаниям и приключениям! <br/>Ну, а я буду всегда с тобой! Муррр–р–р–р <br/>Жми на карту",
  },
];
